{
  "header.menu": "Menu",
  "header.down.home": "Homepage",
  "header.down.task": "Task Evaluation",
  "header.down.test": "Test Set",
  "header.down.projectAddress": "Project Link",
  "header.down.copywriting1": "BAIYULAN OPEN AI ",
  "header.down.api": "API & Demo",
  "header.down.copywriting2": "BAI-Chem",
  "header.down.problem": "About Us",
  "header.down.contactUs": "Contact Us",
  "home.banner.title1": "BAI-Chem",
  "home.banner.title2": "BAI-Chem",
  "home.banner.content": "BAI-Chem utilizes generative artificial intelligence techniques to empower research in chemical synthesis. It stands as the first chemical AI model capable of generating reaction conditions and optimizing them through 'human-in-the-loop' feedback. This model expedites the entire chemical synthesis process, encompassing molecular design, reaction planning, condition generation, and reaction validation, significantly reducing the time needed for designing potential functional molecules, such as pharmaceutical compounds. Traditional methods, which previously took several months, are now condensed to mere minutes.",
  "home.banner.seeMore": "more",
  "home.banner.more": "more",
  "home.content.title1": "BAI-Chem chemical synthesis",
  "home.content.leftText1": "In HIV small molecule design, BAI-Chem rapidly generates 250,000 novel molecules in 2 minutes, screens and identifies 172 potential effective compounds in 30 minutes, offers synthesis routes and reaction conditions, and validates 23 synthesizable molecules within 5 seconds, greatly enhancing design efficiency.",
  "home.content.rightTitle": "BAI-Chem technological pathway",
  "home.content.rightText1": "Building upon traditional page-based search interactions, with the assistance of LLM (Large Language Model) technology, we offer chemical data retrieval and synthesis AI assistant, enabling continuous and convenient human-machine interactions in natural language. ",
  "home.content.rightText2": "Integrated with specialized tools within the field of chemistry, it offers generative and retrieval-based synthesis plans for specified target molecules.",
  "home.content.leftTitle1": "BAI-Chem Retrieval",
  "home.content.leftText2": "Leveraging extensive chemical literature, substance data, and reaction databases, BAI-Chem provides reliable, authoritative, and readily accessible information for rapid knowledge retrieval。",
  "home.content.leftText3": "It supports manual input of molecular details (CAS , SMILES, or molecular structures diagram) to specify molecules for queries, meeting diverse application needs.",
  "home.content.leftText4": "Additionally, it offers recommended synthesis plans, including pathways, conditions, and yields, aiding scientists in swiftly devising synthetic strategies.",
  "home.content.rightTtile2": "BAI-Chem AI Synthesis-Chat",
  "home.content.rightText3": "The chemical chatbot operates at a Ph.D. level, addressing fundamental chemistry inquiries, including SMILES sequence queries, basic chemical element properties, reaction types, and general chemical knowledge. ",
  "home.content.rightText4": "It supports a wide range of tasks, from molecule generation to reaction prediction, catering to the diverse needs of researchers in the field of chemistry, offering comprehensive support and guidance.",
  "task.menu.taskList": "Task List",
  "task.menu.reaction": "Reaction Prediction",
  "task.menu.attribute": "Property Prediction",
  "task.menu.synthesis": "Retrosynthesis",
  "task.menu.productivity": "Yield Prediction",
  "task.menu.conditions": "Condition Generation",
  "task.menu.subTitle": "(Reagent Prediction)",
  "task.content.title1": "Task instructions",
  "task.content.text1": "The evaluation aims to evaluate BAI-Chem in multiple tasks, including reaction prediction, property prediction, retrosynthesis, yield prediction, and condition generation. The performance in these tasks will also be compared with that of ",
  "task.content.textLink": "ChemLLMBench",
  "task.content.count": "1",
  "task.content.textmore": "using the same test dataset. Additionally, for a comprehensive evaluation of BAI-Chem's abilities, self-supervised question-answer pairs have been created based on publicly available test sets, as depicted in the table below.",
  "task.content.tableTitle": "Table 1  USPTO-50k test dataset illustrative",
  "task.content.title2": "Evaluation process",
  "task.content.subTitle1": "1.Preparing evaluation data",
  "task.content.text2": "Constructing self-supervised question-answer pairs based on the USPTO-50k public test set, ensuring diversity in the test set while covering typical chemical synthesis tasks.",
  "task.content.subTitle2": "2.Specipying evaluation metrics",
  "task.content.text3": "{{reaction}}: Metrics include accuracy, recall, RMSE, and others. ",
  "task.content.text4": "{{attribute}}: Metrics include accuracy, recall, F1-Score, and others.",
  "task.content.text5": "{{synthesis}}: Metrics include accuracy, invalid SMILES, and others.",
  "task.content.text6": "{{productivity}}: Metrics include accuracy, BLEU, ROUGE-N, ROUGE-L, and others.",
  "task.content.text7": "{{conditions}}: Metrics include accuracy, R2, RMSE, recall, and others.",
  "task.content.subTitle3": "3.Evaluation process",
  "task.content.text8": "BAI-Chem adapts its scheduling of GPT and specialized chemical synthesis tools based on the task and evaluation samples, generating task-specific metrics. ",
  "task.content.text9": "These metrics are then used to evaluate the performance of the chemical synthesis model across different tasks.",
  "task.content.subTitle4": "4.Evaluation Illustration",
  "task.content.text10": "The schematic of the typical evaluation process is as follows: one can select the evaluation task type within the Task Category and, for the chosen task, further define the evaluation question within the Question section. Upon confirmation, the input for the LLM will be provided.",
  "task.content.subTitle5": "Evalution Result",
  "task.content.text11": "In the context of typical chemical tasks, a comparative evaluation was conducted, involving BAI-Chem V1, BAI-Chem V2, and other public models. The results are presented in the graph below. Notably, BAI-Chem V2 exhibits an enhanced capability in understanding and integrating various chemical multi-tasks compared to BAI-Chem V1. In reaction condition generation task, which includes aspects such as reagents, catalysts, and reaction processes, BAI-Chem V2 outperforms other models. This reflects the model's strong comprehension of various aspects of chemical synthesis. In yield prediction task, BAI-Chem V1 outperforms the publicly available model T5chem. In retrosynthesis and reaction prediction tasks, BAI-Chem V2 shows improvement over BAI-Chem V1, albeit slightly trailing behind the domain state-of-the-art model T5chem. ",
  "task.content.text12": "It's worth noting that the models have not undergone few-shot learning, and we believe there is room for further improvement in model performance in the future.",
  "task.content.echarts": "Figure 2  Evaluation results based on the same dataset",
  "task.content.text13": "It is essential to note that while BAI-Chem demonstrates excellent performance in the mentioned tasks, this does not necessarily guarantee superiority over benchmark models in other chemical tasks. Further evaluation and validation are required to assess BAI-Chem's performance on newly constructed test sets.",
  "task.content.references": "References",
  "task.content.refContent": "[1] Guo, T., Guo, K., Liang, Z., Guo, Z., Chawla, N. V., Wiest, O., & Zhang, X.(2023). What indeed can GPT models do in chemistry? A comprehensive benchmark oneight tasks. arXiv preprint arXiv:2305.18365",
  "task.reaction.title1": "Task instructions",
  "task.reaction.text1": "The forward reaction prediction model describes the prediction of potential reaction products based on provided reactants and reaction conditions. Forward reaction prediction finds significant applications in fields such as drug discovery, catalyst design, and materials synthesis.",
  "task.reaction.tableFooter": "Note: Model/Method refers to the applied model or method, and in this evaluation task, our own models are BAI-Chem V1/V2. Description indicates the year of model release. Top-1/Top-5 (Acc) represents the evaluation metrics assessed by individuals.",
  "task.reaction.title2": "Test Set Description",
  "task.reaction.text2": "Using question-answer samples describing the reaction prediction task from the USPTO-50k public test set, SMILES notations for reactants, products, and reaction conditions are extracted. The",
  "task.reaction.mare": "paper is introduced for comparison.",
  "task.reaction.text3": "The evaluation results, as shown in the table below, indicate that BAI-Chem V2 achieves a Top-1 accuracy of 92.4%. When compared to existing models from publicly available papers, such as Chemformer-Large, it exhibits superior performance.",
  "task.reaction.tableTitle": "Table 1  Reaction prediction evaluation results",
  "task.attribute.text1": "Molecular property prediction involves analyzing molecular structure to anticipate properties, aiding drug discovery. ",
  "task.attribute.text2": "Data for this evaluation is from the ChemLLMBench paper's public test set, and primarily assessing BAI-Chem's HIV property prediction performance in chemical synthesis.",
  "task.attribute.ftext": "Utilizing the HIV property evaluation test set provided by ",
  "task.attribute.text3": " The test set format includes 'SMILES', 'activity', and 'HIV active', representing the tested molecules, their corresponding HIV activity, and binary labels for HIV activity.",
  "task.attribute.tableTitle1": "Table 1  Illustration of the HIV property prediction test set",
  "task.attribute.tableResult": "Note: The results falls into three categories: confirmed invalid (CI), confirmed active (CA), and confirmed moderately active (CM). The result labels include 1 (indicating CA/CM) and 0 (CI).",
  "task.attribute.text4": "The evaluation results are as follows, BAI-Chem V1 achieves an accuracy of 86% in HIV property prediction, surpassing the evaluation results of GPT-4 in the current ChemLLMBench paper.",
  "task.attribute.tableTitle2": "Table 2  HIV property prediction evaluation results",
  "task.synthesis.text1": "Retrosynthesis refers to the prediction of possible reaction sequences for synthesizing a target molecule based on that target molecule. In chemical synthesis, creating a complex target molecule typically involves a series of chemical reaction steps. The retrosynthesis task involves identifying the reverse order of these reaction steps to determine potential pathways for synthesizing the target molecule from available starting materials.",
  "task.synthesis.tableTitle1": "Table 1  Illustration of retrosynthesis test set",
  "task.synthesis.tableResult": "Note: The table indicates the correspondence between reactants and products. 'Reactants' represent the reactants during the reaction, presented in SMILES format with auto-mapping. 'Products' denote the outcomes of the reaction, while 'Class' specifies the reaction category, and 'id' corresponds to the patent index.",
  "task.synthesis.text2": "Based on question-answer samples describing the retrosynthesis task in the USPTO-50k public test set, SMILES notations for reactants and products are extracted. Auto-mapping is constructed, and the ",
  "task.synthesis.more": " paper is introduced for comparison.",
  "task.synthesis.text3": "The evaluation results, as shown in the table below, demonstrate BAI-Chem V2's superior performance with a top-1 accuracy of 72.2% in the reaction prediction task. In comparison to existing models from publicly available papers like RetroFormer and Chemformer, which achieve Top-1 accuracies of 53.2% and 53.6%, respectively, BAI-Chem V2 exhibits competitive performance in retrosynthesis tasks.",
  "task.synthesis.tableTitle2": "Table 2  Retrosynthesis evaluation results",
  "task.productivity.text1": "The yield prediction describes the percentage of reactants converted into the desired products, guiding chemists and aiding them in selecting high-yield reactions and scoring synthesis routes, thereby reducing trial and error attempts.",
  "task.productivity.text2": "Based on the question-answer samples describing the yield prediction task in the USPTO-50k public test set, the SMILES sequences of reactants and products, along with the corresponding yield values for the products, are extracted.",
  "task.productivity.text3": "The evaluation results, as shown in the table below, in terms of the R2 metric, BAI-Chem V1 scores 0.514, surpassing ",
  "task.productivity.type1": "T5chem",
  "task.productivity.and": " and ",
  "task.productivity.type2": "RXN IBM",
  "task.productivity.more": ". After optimization, BAI-Chem V2's performance further improves to 0.88.",
  "task.productivity.tableTitle1": "Figure 1  Yield prediction task evaluation results",
  "task.conditions.text1": "Reaction conditions include the essential information required for carrying out a reaction, encompassing solvents, reagents, catalysts, as well as factors such as temperature, pressure, reaction time, and more. Based on the reactants and products, the BAI-Chem chemical synthesis reaction condition prediction model can provide the necessary conditions for these reactions. This model primarily predicts four categories of reaction conditions, with a representative prompt for evaluation as follows: ",
  "task.conditions.text2": "Based on the USPTO-50k public test dataset for question-answering samples related to the task of conditioned generation for chemical reactions and reagent prediction, the aim is to extract SMILES sequences for the reactants and products of chemical reactions, as well as the corresponding reagent information within the reaction conditions.",
  "task.conditions.tableTitle1": "Table 1  Illustration of the USPTO-50k self-supervised instruction set",
  "task.conditions.text3": "For the reaction condition generation task in BAI-Chem, evaluations were conducted using metrics such as BLEU (Bilingual Evaluation Understudy), ROUGE-1, ROUGE-L, along with an assessment of reagent prediction accuracy (ACC). The evaluation results are as follows:",
  "task.conditions.tableTitle2": "Table 2  Evaluation Results for Reagent Prediction in Condition Generation",
  "contactUs.text": "Please send an email to yanyanxu@sjtu.edu.cn in the following format. We will provide you with feedback promptly upon receiving your message. We look forward to hearing from you.",
  "contactUs.name": "Your Name",
  "contactUs.email": "Email Address",
  "contactUs.theme": "Subject: Please briefly summarize the purpose or subject of your contact with us.",
  "contactUs.content": "Content: Enter the specific information about the questions, opinions, or collaboration requirements you would like to share with us.",
  "contactUs.button": "Close",
  "task.content.echarts1": "Figure 1  BAI-Chem Evaluation Process",
  "task.inverse.tableFooter": "Note: Model/Method refers to the applied model or method, and in this evaluation task, our own models are BAI-Chem V1/V2. Description indicates the year of model release. Top-1/Top-3 (Acc) represents the evaluation metrics assessed by individuals.",
  "about.title": "License",
  "about.text": "The online demo is a research preview intended for non-commercial use only, subject to the model <0>License</0> of LLaMA, <1>Terms of Use</1> of the data generated by OpenAl, and <2>Privacy Practices</2> of ShareGPT. Please contact us If you find any potential violation. The code is released under the Apache License 2.0.",
  "about.team": "Team",
  "about.team.title1": "Principal Investigators:",
  "about.team.name1": "Yanyan Xu",
  "about.team.name2": "Yaohui Jin",
  "about.team.name3": "Xiaokang Yang",
  "about.team.name4": "Jidong Tian",
  "about.team.name5": "Yu Zhang",
  "about.team.name6": "Mengdi Yu",
  "about.team.name7": "Kaipeng Zeng",
  "about.team.name8": "Zhimin Zhang",
  "about.team.name9": "Zengyu Ye",
  "about.team.place1": "AI Institute, SJTU",
  "about.team.place2": "Baiyulan Open AI",
  "about.team.place3": "PaddlePaddle, BAIDU",
  "about.team.des1": "Model development",
  "about.team.des2": "Model development & Evaluation ",
  "about.team.title2": "Researchers:",
  "about.team.title3": "Acknowledge",
  "about.team.text": "We sincerely thank Professor Feng Zhu and Professor Buyong Ma from Shanghai Jiao Tong University for their expert guidance in the field of chemistry, as well as the engineering support from Baidu's PaddlePaddle team and the high-quality open-source data provided by USPTO and ORD."
}